#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/orga_vis/snowflake_project_workspace_TEST/runs/run-cVyppatNML2VRxda

Waiting for the plan to start...

Terraform v1.11.0
on linux_amd64
Initializing plugins and modules...
snowflake_account_role.role: Refreshing state... [id=TEST_POC_VISEO_ROLE]
snowflake_database.db: Refreshing state... [id=TEST_POC_VISEO_DB]
snowflake_warehouse.warehouse: Refreshing state... [id=TEST_WH]
snowflake_schema.raw_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."RAW_LAYER"]
snowflake_schema.bronze_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."BRONZE_LAYER"]
snowflake_schema.gold_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."GOLD_LAYER"]
snowflake_schema.silver_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."SILVER_LAYER"]
snowflake_grant_account_role.grants: Refreshing state... [id="TEST_POC_VISEO_ROLE"|USER|"TERRAF_USER"]
snowflake_grant_account_role.rolegrant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|ROLE|"SYSADMIN"]
snowflake_grant_privileges_to_account_role.executetask: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|EXECUTE TASK|OnAccount]
snowflake_grant_privileges_to_account_role.database_grant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE SCHEMA,MODIFY,USAGE,MONITOR|OnAccountObject|DATABASE|"TEST_POC_VISEO_DB"]
snowflake_grant_privileges_to_account_role.future_tables_grant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|INSERT,SELECT|OnSchemaObject|OnFuture|TABLES|InDatabase|"TEST_POC_VISEO_DB"]
snowflake_grant_privileges_to_account_role.schema_grant_bronze: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE PROCEDURE,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,CREATE SEQUENCE,CREATE NOTEBOOK,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."BRONZE_LAYER"]
snowflake_grant_privileges_to_account_role.schema_grant_silver: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE PROCEDURE,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,CREATE NOTEBOOK,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."SILVER_LAYER"]
snowflake_grant_privileges_to_account_role.schema_grant_gold: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE PROCEDURE,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,CREATE NOTEBOOK,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."GOLD_LAYER"]
snowflake_grant_privileges_to_account_role.schema_grant_raw: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE PROCEDURE,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,CREATE NOTEBOOK,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."RAW_LAYER"]
snowflake_grant_privileges_to_account_role.warehouse_grant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|USAGE|OnAccountObject|WAREHOUSE|"TEST_WH"]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # snowflake_database.db has been deleted
  - resource "snowflake_database" "db" {
        id                                            = "TEST_POC_VISEO_DB"
      - name                                          = "TEST_POC_VISEO_DB" -> null
        # (19 unchanged attributes hidden)
    }

  # snowflake_schema.bronze_layer has been deleted
  - resource "snowflake_schema" "bronze_layer" {
        id                                            = "\"TEST_POC_VISEO_DB\".\"BRONZE_LAYER\""
      - name                                          = "BRONZE_LAYER" -> null
        # (25 unchanged attributes hidden)
    }

  # snowflake_schema.gold_layer has been deleted
  - resource "snowflake_schema" "gold_layer" {
        id                                            = "\"TEST_POC_VISEO_DB\".\"GOLD_LAYER\""
      - name                                          = "GOLD_LAYER" -> null
        # (25 unchanged attributes hidden)
    }

  # snowflake_schema.raw_layer has been deleted
  - resource "snowflake_schema" "raw_layer" {
        id                                            = "\"TEST_POC_VISEO_DB\".\"RAW_LAYER\""
      - name                                          = "RAW_LAYER" -> null
        # (25 unchanged attributes hidden)
    }

  # snowflake_schema.silver_layer has been deleted
  - resource "snowflake_schema" "silver_layer" {
        id                                            = "\"TEST_POC_VISEO_DB\".\"SILVER_LAYER\""
      - name                                          = "SILVER_LAYER" -> null
        # (25 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_database.db will be created
  + resource "snowflake_database" "db" {
      + catalog                                       = (known after apply)
      + comment                                       = "Main dev database"
      + data_retention_time_in_days                   = (known after apply)
      + default_ddl_collation                         = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "TEST_POC_VISEO_DB"
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
    }

  # snowflake_grant_privileges_to_account_role.database_grant will be created
  + resource "snowflake_grant_privileges_to_account_role" "database_grant" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "CREATE SCHEMA",
          + "MODIFY",
          + "MONITOR",
          + "USAGE",
        ]
      + with_grant_option = false

      + on_account_object {
          + object_name = "TEST_POC_VISEO_DB"
          + object_type = "DATABASE"
        }
    }

  # snowflake_grant_privileges_to_account_role.future_tables_grant will be created
  + resource "snowflake_grant_privileges_to_account_role" "future_tables_grant" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "INSERT",
          + "SELECT",
        ]
      + with_grant_option = false

      + on_schema_object {
          + future {
              + in_database        = "TEST_POC_VISEO_DB"
              + object_type_plural = "TABLES"
            }
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant_bronze will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant_bronze" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "CREATE FILE FORMAT",
          + "CREATE NOTEBOOK",
          + "CREATE PIPE",
          + "CREATE PROCEDURE",
          + "CREATE SEQUENCE",
          + "CREATE STAGE",
          + "CREATE STREAM",
          + "CREATE TABLE",
          + "CREATE TASK",
          + "CREATE VIEW",
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"TEST_POC_VISEO_DB\".\"BRONZE_LAYER\""
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant_gold will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant_gold" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "CREATE FILE FORMAT",
          + "CREATE NOTEBOOK",
          + "CREATE PIPE",
          + "CREATE PROCEDURE",
          + "CREATE STAGE",
          + "CREATE STREAM",
          + "CREATE TABLE",
          + "CREATE TASK",
          + "CREATE VIEW",
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"TEST_POC_VISEO_DB\".\"GOLD_LAYER\""
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant_raw will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant_raw" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "CREATE FILE FORMAT",
          + "CREATE NOTEBOOK",
          + "CREATE PIPE",
          + "CREATE PROCEDURE",
          + "CREATE STAGE",
          + "CREATE STREAM",
          + "CREATE TABLE",
          + "CREATE TASK",
          + "CREATE VIEW",
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"TEST_POC_VISEO_DB\".\"RAW_LAYER\""
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant_silver will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant_silver" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "CREATE FILE FORMAT",
          + "CREATE NOTEBOOK",
          + "CREATE PIPE",
          + "CREATE PROCEDURE",
          + "CREATE STAGE",
          + "CREATE STREAM",
          + "CREATE TABLE",
          + "CREATE TASK",
          + "CREATE VIEW",
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"TEST_POC_VISEO_DB\".\"SILVER_LAYER\""
        }
    }

  # snowflake_schema.bronze_layer will be created
  + resource "snowflake_schema" "bronze_layer" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TEST_POC_VISEO_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "BRONZE_LAYER"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_schema.gold_layer will be created
  + resource "snowflake_schema" "gold_layer" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TEST_POC_VISEO_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "GOLD_LAYER"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_schema.raw_layer will be created
  + resource "snowflake_schema" "raw_layer" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TEST_POC_VISEO_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "RAW_LAYER"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_schema.silver_layer will be created
  + resource "snowflake_schema" "silver_layer" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TEST_POC_VISEO_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "SILVER_LAYER"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

Plan: 11 to add, 0 to change, 0 to destroy.
╷
│ Warning: Failed to query database. Marking the resource as removed.
│ 
│   with snowflake_database.db,
│   on databases.tf line 1, in resource "snowflake_database" "db":
│    1: resource "snowflake_database" "db" {
│ 
│ DatabaseName: "TEST_POC_VISEO_DB", Err: object does not exist
│ 
│ (and 4 more similar warnings elsewhere)
╵
╷
│ Warning: Failed to retrieve grants. Target object not found. Marking the resource as removed.
│ 
│   with snowflake_grant_privileges_to_account_role.database_grant,
│   on databases.tf line 7, in resource "snowflake_grant_privileges_to_account_role" "database_grant":
│    7: resource "snowflake_grant_privileges_to_account_role" "database_grant" {
│ 
│ Id: 
│ 
│ (and 5 more similar warnings elsewhere)
╵

```

</details>

*Pusher: @WalidVis, Action: `pull_request`, Working Directory: ``, Workflow: `CI`*